kamso422/STM32F446RE_DRIVERS_PROJECTS/Src/sendData.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "STM32F44xx__driver.h"
#include "STM32F44xxgpio__driver.h"
#include "STM32F44xxSPI__driver.h"
#include <stdlib.h>
#include <string.h>
#define delay for(uint32_t i = 0; i < 250000; i++)

/*
 * Create a function for sending out data using
 * the blocking method
 */
//void disableClock(gpio_handle_t* handle);

SPI_Handle_t theSpi;

int main(void)
{
	uint8_t dummyRx = 0;
	uint8_t dummyRead[13];
	RESET_SPI1_REG();
    char* TxBuffer = "Hello World";
    uint8_t length = strlen(TxBuffer);
    gpio_handle_t SPI_Pin;
    gpio_handle_t button;
    memset(&SPI_Pin,0,sizeof(gpio_handle_t));
    memset(&button,0,sizeof(gpio_handle_t));

    //Enable peripheral Clock for GPIO pins
    GPIO_PeriClockControl(GPIOA, ENABLE);

    //Set up the button
    button.gpioReg = GPIOA;
    button.gpioConfigure.MODE = GPIO_MODE_INPUT;
    button.gpioConfigure.OSPEED = GPIO_LOW_SPEED;
    button.gpioConfigure.OTYPE = GPIO_PP;
    button.gpioConfigure.PUPD = GPIO_PU;
    button.gpioConfigure.pinNumber = GPIO_PIN_NO_8;

    gpioInit(&button);

    //Set up the SPI1 pins
    SPI_Pin.gpioReg = GPIOA;
    SPI_Pin.gpioConfigure.MODE = GPIO_MODE_ALFN;
    SPI_Pin.gpioConfigure.ALTF = AF5;
    SPI_Pin.gpioConfigure.OSPEED = GPIO_LOW_SPEED;
    SPI_Pin.gpioConfigure.PUPD = GPIO_NO_PUPD;
    SPI_Pin.gpioConfigure.OTYPE = GPIO_PP;

    //Set up the MOSI pin
    SPI_Pin.gpioConfigure.pinNumber = GPIO_PIN_NO_7;
    gpioInit(&SPI_Pin);
    //Configure the MISO pin
    SPI_Pin.gpioConfigure.pinNumber = GPIO_PIN_NO_6;
    gpioInit(&SPI_Pin);
    //Set up the clock pin
    SPI_Pin.gpioConfigure.pinNumber = GPIO_PIN_NO_5;
    gpioInit(&SPI_Pin);
    //Set up the NSS pin
    SPI_Pin.gpioConfigure.pinNumber = GPIO_PIN_NO_4;
    gpioInit(&SPI_Pin);

    memset(&theSpi,0,sizeof(SPI_Handle_t));

    //Enable the peripheral clock for SPI peripheral
    SPI_PeriClockControl(SPI1, ENABLE);
    //Initialize the SPI peripheral
    theSpi.pSPIx = SPI1;
    theSpi.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
    theSpi.SPIConfig.SPI_CPHA = SPI_CPHA1;
    theSpi.SPIConfig.SPI_CPOL = SPI_CPOL0;
    theSpi.SPIConfig.SPI_DFF = DFF8;
    theSpi.SPIConfig.SPI_DeviceMode = MASTER;
    theSpi.SPIConfig.SPI_SSM = SSM_HW;
    theSpi.SPIConfig.SPI_SclkSpeed = SPI_CLK_SPEED_DIV256;


    spiInit(&theSpi);
    SPI_IRQConfig(SPI1_IRQ_NUM, ENABLE);

    setSSOE(SPI1, ENABLE);
    while(1){

    while(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_8));

    spiEnable(SPI1, ENABLE);
    SPI_SendDataIT(&theSpi, &length, 1);
    SPI_ReceiveDataIT(&theSpi, &dummyRx, 1);
    SPI_SendDataIT(&theSpi, (uint8_t*)TxBuffer, strlen(TxBuffer));
    SPI_ReceiveDataIT(&theSpi, dummyRead, strlen(TxBuffer));
    spiEnable(SPI1, DISABLE);
    delay;
    }

    //while(1);
}

void SPI1_IRQHandler(void){
	SPI_IRQHandler(&theSpi);
}

